configs/tsung.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <servers>
    <server host="myserver" port="80" type="tcp"/>
  </servers>

  <monitoring>
    <monitor host="myserver" type="snmp"/>
  </monitoring>
  
  <load duration="30" unit="second">
    <arrivalphase phase="1" duration="30" unit="second">
      <users maxnumber="20" arrivalrate="100" unit="second"/>
    </arrivalphase>
  </load>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <for from="1" to="1000000" var="i">
        <request> <http url="TARGETURL" method="GET" version="1.1"/> </request>
      </for>
    </session>
  </sessions>

</tsung>